XKCANO/ceshi0223/KD001-0115C/Library/inc/fm33lf0xx_fl_gpio.h
/**
  *******************************************************************************************************
  * @file    fm33lf0xx_fl_gpio.h
  * @author  FMSH Application Team
  * @brief   Head file of GPIO FL Module
  *******************************************************************************************************
  * @attention
  *
  * Copyright (c) [2021] [Fudan Microelectronics]
  * THIS SOFTWARE is licensed under Mulan PSL v2.
  * You can use this software according to the terms and conditions of the Mulan PSL v2.
  * You may obtain a copy of Mulan PSL v2 at:
  *          http://license.coscl.org.cn/MulanPSL2
  * THIS SOFTWARE IS PROVIDED ON AN "AS IS" BASIS, WITHOUT WARRANTIES OF ANY KIND,
  * EITHER EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO NON-INFRINGEMENT,
  * MERCHANTABILITY OR FIT FOR A PARTICULAR PURPOSE.
  * See the Mulan PSL v2 for more details.
  *
  *******************************************************************************************************
  */


/* Define to prevent recursive inclusion---------------------------------------------------------------*/
#ifndef __FM33LF0XX_FL_GPIO_H
#define __FM33LF0XX_FL_GPIO_H

#ifdef __cplusplus
extern "C" {
#endif
/* Includes -------------------------------------------------------------------------------------------*/
#include "fm33lf0xx_fl_def.h"
/** @addtogroup FM33LF0XX_FL_Driver
  * @{
  */

/** @defgroup GPIO GPIO
  * @brief GPIO FL driver
  * @{
  */

/* Exported types -------------------------------------------------------------------------------------*/
/** @defgroup GPIO_FL_ES_INIT GPIO Exported Init structures
  * @{
  */
/**
  * @brief FL GPIO Init Sturcture definition
  */
typedef struct
{
    /*! PIN */
    uint32_t pin;

    /*! 功能模式 */
    uint32_t mode;

    /*! 输出类型 */
    uint32_t outputType;

    /* 驱动强度*/
    uint32_t driveStrength;

    /* 上下拉选择*/
    uint32_t pull;

    /*! 数字功能重定向 */
    uint32_t remapPin;	 
	
	  /*! 模拟开关使能 */
    FL_FunState analogSwitch;

} FL_GPIO_InitTypeDef;

/**
  * @brief FL GPIO WKUP Init Sturcture definition
  */
typedef struct
{
    /*! 触发边沿 */
    uint32_t polarity;

} FL_WKUP_InitTypeDef;

/**
  * @}
  */
/* Exported constants ---------------------------------------------------------------------------------*/
/** @defgroup GPIO_FL_Exported_Constants GPIO Exported Constants
  * @{
  */

#define    GPIO_FCR_Pos                                           (0U)
#define    GPIO_FCR_Msk                                           (0x3U << GPIO_FCR_Pos)
#define    GPIO_FCR                                                GPIO_FCR_Msk

#define    GPIO_PUDEN_PUD_Pos                                     (16U)
#define    GPIO_PUDEN_PUD_Msk                                     (0x1U << GPIO_PUDEN_PUD_Pos)
#define    GPIO_PUDEN_PUD                                          GPIO_PUDEN_PUD_Msk

#define    GPIO_PUDEN_PUDEN_Pos                                   (0U)
#define    GPIO_PUDEN_PUDEN_Msk                                   (0x1U << GPIO_PUDEN_PUDEN_Pos)
#define    GPIO_PUDEN_PUDEN                                       GPIO_PUDEN_PUDEN_Msk

#define    GPIO_DFS_Pos                                           (0U)
#define    GPIO_DFS_Msk                                           (0x3U << GPIO_DFS_Pos)
#define    GPIO_DFS                                               GPIO_DFS_Msk

#define    GPIO_EXTIEDS_Pos                                       (0U)
#define    GPIO_EXTIEDS_Msk                                       (0x3U << GPIO_EXTIEDS_Pos)
#define    GPIO_EXTIEDS                                           GPIO_EXTIEDS_Msk

#define    GPIO_FOUTSEL_FOUT0_Pos                                 (0U)
#define    GPIO_FOUTSEL_FOUT0_Msk                                 (0xfU << GPIO_FOUTSEL_FOUT0_Pos)
#define    GPIO_FOUTSEL_FOUT0                                      GPIO_FOUTSEL_FOUT0_Msk

#define    GPIO_FOUTSEL_FOUT1_Pos                                 (4U)
#define    GPIO_FOUTSEL_FOUT1_Msk                                 (0xfU << GPIO_FOUTSEL_FOUT1_Pos)
#define    GPIO_FOUTSEL_FOUT1                                      GPIO_FOUTSEL_FOUT1_Msk

#define    GPIO_EXTISEL_EXTI0_Pos                                 (0U)
#define    GPIO_EXTISEL_EXTI0_Msk                                 (0x3U << GPIO_EXTISEL_EXTI0_Pos)
#define    GPIO_EXTISEL_EXTI0                                      GPIO_EXTISEL_EXTI0_Msk

#define    GPIO_EXTISEL_EXTI1_Pos                                 (2U)
#define    GPIO_EXTISEL_EXTI1_Msk                                 (0x3U << GPIO_EXTISEL_EXTI1_Pos)
#define    GPIO_EXTISEL_EXTI1                                     GPIO_EXTISEL_EXTI1_Msk

#define    GPIO_EXTISEL_EXTI2_Pos                                 (4U)
#define    GPIO_EXTISEL_EXTI2_Msk                                 (0x3U << GPIO_EXTISEL_EXTI2_Pos)
#define    GPIO_EXTISEL_EXTI2                                     GPIO_EXTISEL_EXTI2_Msk

#define    GPIO_EXTISEL_EXTI3_Pos                                 (6U)
#define    GPIO_EXTISEL_EXTI3_Msk                                 (0x3U << GPIO_EXTISEL_EXTI3_Pos)
#define    GPIO_EXTISEL_EXTI3                                     GPIO_EXTISEL_EXTI3_Msk

#define    GPIO_EXTISEL_EXTI4_Pos                                 (8U)
#define    GPIO_EXTISEL_EXTI4_Msk                                 (0x3U << GPIO_EXTISEL_EXTI4_Pos)
#define    GPIO_EXTISEL_EXTI4                                     GPIO_EXTISEL_EXTI4_Msk

#define    GPIO_EXTISEL_EXTI5_Pos                                 (10U)
#define    GPIO_EXTISEL_EXTI5_Msk                                 (0x3U << GPIO_EXTISEL_EXTI5_Pos)
#define    GPIO_EXTISEL_EXTI5                                     GPIO_EXTISEL_EXTI5_Msk

#define    GPIO_EXTISEL_EXTI6_Pos                                 (12U)
#define    GPIO_EXTISEL_EXTI6_Msk                                 (0x3U << GPIO_EXTISEL_EXTI6_Pos)
#define    GPIO_EXTISEL_EXTI6                                     GPIO_EXTISEL_EXTI6_Msk

#define    GPIO_EXTISEL_EXTI7_Pos                                 (14U)
#define    GPIO_EXTISEL_EXTI7_Msk                                 (0x3U << GPIO_EXTISEL_EXTI7_Pos)
#define    GPIO_EXTISEL_EXTI7                                     GPIO_EXTISEL_EXTI7_Msk

#define    GPIO_EXTISEL_EXTI8_Pos                                 (16U)
#define    GPIO_EXTISEL_EXTI8_Msk                                 (0x3U << GPIO_EXTISEL_EXTI8_Pos)
#define    GPIO_EXTISEL_EXTI8                                     GPIO_EXTISEL_EXTI8_Msk

